In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import os

In [2]:
data=pd.read_csv('C:/Users/Pankaj Mali/Downloads/archive (3)/Health_insurance.csv')

In [3]:
data.shape

(1338, 7)

In [4]:
data.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [5]:
data.tail()

      age     sex    bmi  children smoker     region     charges
1333   50    male  30.97         3     no  northwest  10600.5483
1334   18  female  31.92         0     no  northeast   2205.9808
1335   18  female  36.85         0     no  southeast   1629.8335
1336   21  female  25.80         0     no  southwest   2007.9450
1337   61  female  29.07         0    yes  northwest  29141.3603

In [7]:
#very important code-
print("Percentage of females who smoke:", data["smoker"][data["sex"] == 'female'].value_counts())
print("Percentage of males who smoke:", data["smoker"][data["sex"] == 'male'].value_counts())

Percentage of females who smoke: no     547
yes    115
Name: smoker, dtype: int64
Percentage of males who smoke: no     517
yes    159
Name: smoker, dtype: int64

In [10]:
print("Percentage of males who smoke:", data["smoker"][data["sex"] == 'female'].value_counts(normalize = True)[1]*100)
print("Percentage of males who smoke:", data["smoker"][data["sex"] == 'male'].value_counts(normalize = True)[1]*100)

Percentage of males who smoke: 17.371601208459214
Percentage of males who smoke: 23.5207100591716

In [6]:
data.describe()

               age          bmi     children       charges
count  1338.000000  1338.000000  1338.000000   1338.000000
mean     39.207025    30.663397     1.094918  13270.422265
std      14.049960     6.098187     1.205493  12110.011237
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.296250     0.000000   4740.287150
50%      39.000000    30.400000     1.000000   9382.033000
75%      51.000000    34.693750     2.000000  16639.912515
max      64.000000    53.130000     5.000000  63770.428010

In [7]:
age=data['age'].min(),data['age'].max() 
age

(18, 64)

In [8]:
ageuni=data['age'].unique()
ageuni.sort()
print(ageuni)
print()
print(len(ageuni))

[18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41
 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64]

47

In [9]:
ageuni1=data['age'].value_counts()
print(ageuni1)

18    69
19    68
50    29
51    29
47    29
46    29
45    29
20    29
48    29
52    29
22    28
49    28
54    28
53    28
21    28
26    28
24    28
25    28
28    28
27    28
23    28
43    27
29    27
30    27
41    27
42    27
44    27
31    27
40    27
32    26
33    26
56    26
34    26
55    26
57    26
37    25
59    25
58    25
36    25
38    25
35    25
39    25
61    23
60    23
63    23
62    23
64    22
Name: age, dtype: int64

In [10]:
ageuni2=data['age'].value_counts().max() , data['age'].value_counts().min()
print(ageuni2)

(69, 22)

In [11]:
sex1=data['sex'].unique()
sex1
sex2=data['sex'].value_counts()
sex2

male      676
female    662
Name: sex, dtype: int64

In [12]:
bmi1=data['bmi'].min(), data['bmi'].max()
bmi1

(15.96, 53.13)

In [13]:
bmi2=data['bmi'].value_counts()
bmi2

32.300    13
28.310     9
30.495     8
30.875     8
31.350     8
          ..
46.200     1
23.800     1
44.770     1
32.120     1
30.970     1
Name: bmi, Length: 548, dtype: int64

In [14]:
bmi3=data['bmi'].value_counts().max(),data['bmi'].value_counts().min()
bmi3

(13, 1)

In [15]:
child1=data['children'].value_counts()
child1

0    574
1    324
2    240
3    157
4     25
5     18
Name: children, dtype: int64

In [16]:
smoke1=data['smoker'].value_counts()
smoke1

no     1064
yes     274
Name: smoker, dtype: int64

In [17]:
reg1=data['region'].value_counts()
reg1

southeast    364
southwest    325
northwest    325
northeast    324
Name: region, dtype: int64

In [18]:
df1=data[['age','sex','bmi','children','smoker','region','charges']].groupby('sex').min()
df1

        age     bmi  children smoker     region    charges
sex
female   18  16.815         0     no  northeast  1607.5101
male     18  15.960         0     no  northeast  1121.8739

In [19]:
df2=data[['age','sex','children','smoker','region','charges']].groupby(['region','sex']).min()
df2

                  age  children smoker     charges
region    sex
northeast female   18         0     no  2196.47320
          male     18         0     no  1694.79640
northwest female   19         0     no  2117.33885
          male     19         0     no  1621.34020
southeast female   18         0     no  1607.51010
          male     18         0     no  1121.87390
southwest female   19         0     no  1727.78500
          male     19         0     no  1241.56500

In [20]:
df3=data[['age','sex','children','smoker','region','charges']].groupby(['region','sex']).max()
df3

                  age  children smoker      charges
region    sex
northeast female   64         4    yes  58571.07448
          male     64         5    yes  48549.17835
northwest female   64         5    yes  55135.40209
          male     64         4    yes  60021.39897
southeast female   64         5    yes  63770.42801
          male     64         5    yes  62592.87309
southwest female   64         5    yes  48824.45000
          male     64         5    yes  52590.82939

In [21]:
df4=data[['sex','smoker','region','charges']].groupby(['region','sex']).max()
df4

                 smoker      charges
region    sex
northeast female    yes  58571.07448
          male      yes  48549.17835
northwest female    yes  55135.40209
          male      yes  60021.39897
southeast female    yes  63770.42801
          male      yes  62592.87309
southwest female    yes  48824.45000
          male      yes  52590.82939

In [22]:
df4=data[['sex','smoker','region','charges']].groupby(['region','sex']).min()
df4

                 smoker     charges
region    sex
northeast female     no  2196.47320
          male       no  1694.79640
northwest female     no  2117.33885
          male       no  1621.34020
southeast female     no  1607.51010
          male       no  1121.87390
southwest female     no  1727.78500
          male       no  1241.56500

In [23]:
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler
from sklearn.preprocessing import LabelEncoder

In [24]:
data['sex1']=LabelEncoder().fit_transform(data['sex'])
data['smoke2']=LabelEncoder().fit_transform(data['smoker'])
data['region3']=LabelEncoder().fit_transform(data['region'])
data

,age,sex,bmi,children,smoker,region,charges,sex1,smoke2,region3
0,19,female,27.900,0,yes,southwest,16884.92400,0,1,3
1,18,male,33.770,1,no,southeast,1725.55230,1,0,2
2,28,male,33.000,3,no,southeast,4449.46200,1,0,2
3,33,male,22.705,0,no,northwest,21984.47061,1,0,1
4,32,male,28.880,0,no,northwest,3866.85520,1,0,1
...,...,...,...,...,...,...,...,...,...,...
1333,50,male,30.970,3,no,northwest,10600.54830,1,0,1
1334,18,female,31.920,0,no,northeast,2205.98080,0,0,0
1335,18,female,36.850,0,no,southeast,1629.83350,0,0,2
1336,21,female,25.800,0,no,southwest,2007.94500,0,0,3
1337,61,female,29.070,0,yes,northwest,29141.36030,0,1,1

In [25]:
data['region3'].unique()

array([3, 2, 1, 0])

x=StandardScaler().fit_transform(data)
x

In [26]:
newd1=data.drop(data[['sex','smoker','region']],axis=1)
newd1

      age     bmi  children      charges  sex1  smoke2  region3
0      19  27.900         0  16884.92400     0       1        3
1      18  33.770         1   1725.55230     1       0        2
2      28  33.000         3   4449.46200     1       0        2
3      33  22.705         0  21984.47061     1       0        1
4      32  28.880         0   3866.85520     1       0        1
...   ...     ...       ...          ...   ...     ...      ...
1333   50  30.970         3  10600.54830     1       0        1
1334   18  31.920         0   2205.98080     0       0        0
1335   18  36.850         0   1629.83350     0       0        2
1336   21  25.800         0   2007.94500     0       0        3
1337   61  29.070         0  29141.36030     0       1        1

[1338 rows x 7 columns]

In [27]:
x_train,x_test,y_train,y_test=train_test_split(newd1.drop(['charges'],axis=1),newd1['charges'],test_size=0.28,random_state=15)

In [28]:
model=LinearRegression()
model.fit(x_train,y_train)

LinearRegression()

In [29]:
accuracy=model.score(x_test,y_test)
print(accuracy*100)

80.2642359455768